Revit 2026 API

# MetalMetalPatternHeight Property

---

The property labeled "Amount" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalPatternHeight { get; }
```
```vb
Public Shared ReadOnly Property MetalPatternHeight As String
	Get
```
```cpp
public:
static property String^ MetalPatternHeight {
	String^ get ();
}
```
```fsharp
static member MetalPatternHeight : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 2".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace